package org.example.day9.chracterFile;

public class FileHandlingPractice {
    //1.파일을 다루는 클래스를 크게 2가지로 나누어 각각을 비교 설명
    //2.바이트 스트림과 문자 스트림의 차이
    //3.Reader, Writer 가 붙어있는 클래스 이름은 바이트 스트림인가? 문자 스트림인가?
    //4.스트림은 무엇?
    //5.바이트 스트림으로 읽을 때 한번에 하나씩 읽는 것이 아니라
    // 여러개를 읽어서 저장공간에 넣고 싶을때 사용하는 것은?
    //6.바이트스트림 도착한 입력데이터를 문자스트림으로 읽어오고 싶을 때 사용하는 브릿지역할의 클래스는?
    //7.Buffer 를 사용하면 좋은 점은?
    //8.스트림을 다룰 때 꼭 해주어야하는 것은?
    //9.버퍼에 있는 데이터를 한 줄 씩 읽어왔을때 리턴 타입은?
    //10.버퍼에 있는 데이터를 한 줄 씩 읽어왔을때 더이상 없으면 반환되는 것은?
    //Note Organise
}
